MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GM304/mcu.h
#define __FPOR_BASE 0x155f2
#define __FPOR_LENGTH 0x2

#define __FWDT_BASE 0x155f4
#define __FWDT_LENGTH 0x2

#define __FOSC_BASE 0x155f6
#define __FOSC_LENGTH 0x2

#define __FOSCSEL_BASE 0x155f8
#define __FOSCSEL_LENGTH 0x2

#define __FGS_BASE 0x155fa
#define __FGS_LENGTH 0x2

#define __FUID0_BASE 0x800ff8
#define __FUID0_LENGTH 0x2

#define __FUID1_BASE 0x800ffa
#define __FUID1_LENGTH 0x2

#define __FUID2_BASE 0x800ffc
#define __FUID2_LENGTH 0x2

#define __FUID3_BASE 0x800ffe
#define __FUID3_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x4000

#define __YDATA_BASE 0x3000
#define __YDATA_LENGTH 0x3000
#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x4000

#define __YDATA_BASE 0x3000
#define __YDATA_LENGTH 0x3000
#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x4000

#define __YDATA_BASE 0x3000
#define __YDATA_LENGTH 0x3000

/*
 * PPS Remapping Pin Names
 */

#define _RPOUT_U1TX 1
#define _RPOUT_U2TX 3
#define _RPOUT_SDO2 8
#define _RPOUT_SCK2OUT 9
#define _RPOUT_SS2OUT 10
#define _RPOUT_CSDO 11
#define _RPOUT_CSCKOUT 12
#define _RPOUT_COFSOUT 13
#define _RPOUT_OC1 16
#define _RPOUT_OC2 17
#define _RPOUT_OC3 18
#define _RPOUT_OC4 19
#define _RPOUT_OC5 20
#define _RPOUT_OC6 21
#define _RPOUT_OC7 22
#define _RPOUT_OC8 23
#define _RPOUT_C1OUT 24
#define _RPOUT_C2OUT 25
#define _RPOUT_C3OUT 26
#define _RPOUT_U3TX 27
#define _RPOUT_U3RTS 28
#define _RPOUT_U4TX 29
#define _RPOUT_U4RTS 30
#define _RPOUT_SDO3 31
#define _RPOUT_SCK3OUT 32
#define _RPOUT_SS3OUT 33
#define _RPOUT_PSYNCO1 45
#define _RPOUT_PSYNCO2 46
#define _RPOUT_QEI1CCMP 47
#define _RPOUT_QEI2CCMP 48
#define _RPOUT_REFCLK 49
#define _RPOUT_C4OUT 50
#define _RPOUT_C5OUT 51

#endif
